[
        {"word": "apple", "definition": "A fruit that is typically red, green, or yellow."},
        {"word": "book", "definition": "A set of written, printed, or blank pages fastened together."},
        {"word": "cat", "definition": "A small domesticated carnivorous mammal."},
        {"word": "dog", "definition": "A domesticated carnivorous mammal that typically has a long snout."},
        {"word": "elephant", "definition": "A large herbivorous mammal with a trunk."},
        {"word": "flower", "definition": "The seed-bearing part of a plant."},
        {"word": "guitar", "definition": "A stringed musical instrument."},
        {"word": "house", "definition": "A building for human habitation."},
        {"word": "ice", "definition": "Frozen water."},
        {"word": "jungle", "definition": "An area of land overgrown with dense forest and tangled vegetation."},
        {"word": "kite", "definition": "A toy consisting of a light frame with thin material stretched over it."},
        {"word": "lion", "definition": "A large tawny-colored cat that lives in prides."},
        {"word": "mountain", "definition": "A large natural elevation of the earth's surface."},
        {"word": "notebook", "definition": "A small book with blank or ruled pages for writing notes."},
        {"word": "ocean", "definition": "A vast body of salt water that covers almost three-quarters of the earth's surface."},
        {"word": "pencil", "definition": "An instrument for writing or drawing, consisting of a thin stick of graphite or a similar substance."},
        {"word": "queen", "definition": "The female ruler of an independent state, especially one who inherits the position by right of birth."},
        {"word": "rain", "definition": "Moisture condensed from the atmosphere that falls visibly in separate drops."},
        {"word": "sun", "definition": "The star around which the earth orbits."},
        {"word": "tree", "definition": "A woody perennial plant, typically having a single stem or trunk."},
        {"word": "umbrella", "definition": "A device consisting of a circular canopy of cloth on a folding metal frame supported by a central rod."},
        {"word": "violin", "definition": "A stringed musical instrument of treble pitch."},
        {"word": "water", "definition": "A colorless, transparent, odorless liquid that forms the seas, lakes, rivers, and rain."},
        {"word": "xylophone", "definition": "A musical instrument played by striking a row of wooden bars of graduated length with one or more small wooden or plastic mallets."},
        {"word": "yacht", "definition": "A medium-sized sailboat equipped for cruising or racing."},
        {"word": "zebra", "definition": "An African wild horse with black-and-white stripes and an erect mane."},
        {"word": "anchor", "definition": "A heavy object used to moor a vessel to the sea bottom."},
        {"word": "bridge", "definition": "A structure carrying a road, path, or railway across a river, road, or other obstacle."},
        {"word": "camera", "definition": "A device for recording visual images in the form of photographs or video."},
        {"word": "desert", "definition": "A barren area of landscape with little precipitation."},
        {"word": "engine", "definition": "A machine with moving parts that converts power into motion."},
        {"word": "forest", "definition": "A large area covered chiefly with trees and undergrowth."},
        {"word": "garden", "definition": "A piece of ground adjoining a house, used for growing flowers, vegetables, or fruits."},
        {"word": "hammer", "definition": "A tool with a heavy metal head mounted at right angles at the end of a handle."},
        {"word": "island", "definition": "A piece of land surrounded by water."},
        {"word": "jacket", "definition": "An outer garment extending to the waist or hips."},
        {"word": "kitchen", "definition": "A room or area where food is prepared and cooked."},
        {"word": "ladder", "definition": "A structure consisting of a series of bars or steps between two upright lengths of wood, metal, or rope."},
        {"word": "mirror", "definition": "A reflective surface, typically of glass coated with a metal amalgam."},
        {"word": "needle", "definition": "A very fine slender piece of metal with a point at one end and a hole for thread at the other."},
        {"word": "orange", "definition": "A round juicy citrus fruit with a tough bright reddish-yellow rind."},
        {"word": "piano", "definition": "A large keyboard musical instrument with a wooden case."},
        {"word": "quilt", "definition": "A warm bed covering made of padding enclosed between layers of fabric."},
        {"word": "river", "definition": "A large natural stream of water flowing in a channel to the sea, a lake, or another river."},
        {"word": "spoon", "definition": "An implement consisting of a small, shallow oval or round bowl on a long handle."},
        {"word": "table", "definition": "A piece of furniture with a flat top and one or more legs."},
        {"word": "universe", "definition": "All existing matter and space considered as a whole; the cosmos."},
        {"word": "valley", "definition": "A low area of land between hills or mountains, typically with a river or stream flowing through it."},
        {"word": "window", "definition": "An opening in the wall of a building to admit light or air."},
        {"word": "axis", "definition": "An imaginary line about which a body rotates."},
        {"word": "banana", "definition": "A long curved fruit which grows in clusters and has soft pulpy flesh and yellow skin when ripe."},
        {"word": "cloud", "definition": "A visible mass of condensed water vapor floating in the atmosphere."},
        {"word": "diamond", "definition": "A precious stone consisting of a clear and colorless crystalline form of pure carbon."},
        {"word": "eagle", "definition": "A large bird of prey with a massive hooked bill and long broad wings."},
        {"word": "fabric", "definition": "Cloth or other material produced by weaving or knitting fibers."},
        {"word": "globe", "definition": "A spherical representation of the earth or the heavens."},
        {"word": "helmet", "definition": "A hard or padded protective hat."},
        {"word": "ink", "definition": "A colored fluid or paste used for writing, drawing, or printing."},
        {"word": "journal", "definition": "A daily record of news and events of a personal nature; a diary."},
        {"word": "kettle", "definition": "A container for boiling water, with a lid, spout, and handle."},
        {"word": "lamp", "definition": "A device for giving light, either by the use of electricity or by burning gas or oil."},
        {"word": "magnet", "definition": "A piece of iron or other material which has its component atoms so ordered that it attracts iron."},
        {"word": "nest", "definition": "A structure or place made or chosen by a bird for laying eggs and sheltering its young."},
        {"word": "orbit", "definition": "The curved path of a celestial object around a star, planet, or moon."},
        {"word": "palace", "definition": "A large and impressive building forming the official residence of a ruler or dignitary."},
        {"word": "rocket", "definition": "A cylindrical projectile that can be propelled to a great height or distance."},
        {"word": "shadow", "definition": "A dark area or shape produced by a body coming between rays of light and a surface."},
        {"word": "thunder", "definition": "A loud rumbling or crashing noise heard after a lightning flash."},
        {"word": "vehicle", "definition": "A thing used for transporting people or goods, especially on land."},
        {"word": "whale", "definition": "A very large marine mammal with a streamlined hairless body and horizontal tail fin."},
        {"word": "yarn", "definition": "Spun thread used for knitting, weaving, or sewing."},
        {"word": "zipper", "definition": "A device consisting of two flexible strips with interlocking metal or plastic teeth."},
        {"word": "balloon", "definition": "A brightly colored rubber sac inflated with air and used as a toy or decoration."},
        {"word": "compass", "definition": "An instrument containing a magnetized pointer which shows the direction of magnetic north."},
        {"word": "drum", "definition": "A percussion instrument sounded by being struck with sticks or the hands."},
        {"word": "API", "definition": "Application Programming Interface, a set of protocols and tools for building software applications."},
        {"word": "database", "definition": "An organized collection of structured information or data stored electronically in a computer system."},
        {"word": "server", "definition": "A computer or system that provides resources, data, services, or programs to other computers over a network."},
        {"word": "middleware", "definition": "Software that acts as a bridge between an operating system or database and applications."},
        {"word": "endpoint", "definition": "A specific URL where an API can access the resources it needs to perform its function."},
        {"word": "authentication", "definition": "The process of verifying the identity of a user or system attempting to access a resource."},
        {"word": "query", "definition": "A request for data or information from a database using a specific command or syntax."},
        {"word": "cache", "definition": "A hardware or software component that stores data temporarily to serve future requests faster."},
        {"word": "deployment", "definition": "The process of making a software application available for use in a production environment."},
        {"word": "framework", "definition": "A platform providing a foundation and structure for developing software applications."},
        {"word": "JSON", "definition": "JavaScript Object Notation, a lightweight data interchange format that is easy to read and write."},
        {"word": "REST", "definition": "Representational State Transfer, an architectural style for designing networked applications using HTTP requests."},
        {"word": "debugging", "definition": "The process of identifying and removing errors or bugs from computer software."},
        {"word": "algorithm", "definition": "A step-by-step procedure or formula for solving a problem or performing a computation."},
        {"word": "encryption", "definition": "The process of converting information into a coded format to prevent unauthorized access."},
        {"word": "bandwidth", "definition": "The maximum rate of data transfer across a given path or network connection."},
        {"word": "repository", "definition": "A central location where data, code, or files are stored and managed, often using version control."},
        {"word": "webhook", "definition": "A method of augmenting or altering web page behavior using custom callbacks triggered by events."},
        {"word": "schema", "definition": "The structure or organization of a database, defining how data is arranged and related."},
        {"word": "latency", "definition": "The time delay between a request being sent and the response being received in a network or system."}
]